app/controllers/answers_controller.rb

  def show
    @answer = Answer.find(params[:id])
    @user = User.find(@answer.user_id)
---
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def new
    @answer = Answer.new
    @user = User.find(params[:id])
    @user.answers.last.nil? ? @ansnum = 0 : @ansnum = @user.answers.last.ansnum
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."user_id" = ? ORDER BY "answers"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

  def create
    @user = User.find(params[:id])
    @answer = @user.answers.create(answer_params)
    #binding.pry
    #@answer = Answer.new(answer_params)
    next_ans = @user.answers.last.ansnum
    #binding.pry
    respond_to do |format|
      if @answer.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
INSERT INTO "answers" ("created_at", "updated_at", "user_id", "result", "ansnum") VALUES (?, ?, ?, ?, ?)  [["created_at", "2019-12-05 18:25:17.228799"], ["updated_at", "2019-12-05 18:25:17.228799"], ["user_id", 12], ["result", 0], ["ansnum", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."user_id" = ? ORDER BY "answers"."id" DESC LIMIT ?  [["user_id", 12], ["LIMIT", 1]]
INSERT INTO "answers" ("created_at", "updated_at", "user_id", "result", "ansnum", "score") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2019-12-06 06:14:57.190846"], ["updated_at", "2019-12-06 06:14:57.190846"], ["user_id", 15], ["result", 1], ["ansnum", 11], ["score", 70]]

  def destroy
    @answer.destroy
---
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 308]]

  def user_answer
    @user = User.find(params[:user_id])
    @answers = @user.answers.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]