app/controllers/answers_controller.rb

  def create
    @user = User.find(params[:id])
    @answer = @user.answers.create(answer_params)
---
INSERT INTO "answers" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2019-11-07 15:40:28.288159"], ["updated_at", "2019-11-07 15:40:28.288159"], ["user_id", 1]]

  def destroy
    @answer.destroy
---
DELETE FROM "answers" WHERE "answers"."id" = ?  [["id", 1]]