app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "grade", "gender", "created_at", "updated_at", "student_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["first_name", "セラ"], ["last_name", "ナルモト"], ["grade", 3], ["gender", "男性"], ["created_at", "2019-12-05 10:42:11.597267"], ["updated_at", "2019-12-05 10:42:11.597267"], ["student_id", 71646422]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = ?, "last_name" = ?, "grade" = ?, "gender" = ?, "student_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["first_name", "優花"], ["last_name", "斎藤"], ["grade", 2], ["gender", "女性"], ["student_id", 71843371], ["updated_at", "2019-12-06 05:49:11.864564"], ["id", 15]]